"---------------------------------------------------------------------------
" カラー設定:
colorscheme industry
"---------------------------------------------------------------------------
" ウインドウに関する設定:
"
" ウインドウの幅
set columns=140
" ウインドウの高さ
set lines=40
" コマンドラインの高さ(GUI使用時)
set cmdheight=2

" 起動時に画面最大化(GUI使用時)
au GUIEnter * simalt ~x
"---------------------------------------------------------------------------
" フォント設定:
"
" 半角文字の設定
set guifont=MS_Gothic:h10

" 全角文字の設定
set guifontwide=MS_Gothic:h10
"---------------------------------------------------------------------------
autocmd GUIEnter * set transparency=200
