"---------------------------------------------------------------------------
" plugins下のディレクトリをruntimepathへ追加する。
"---------------------------------------------------------------------------
for s:path in split(glob($VIM.'/plugins/*'), '\n')
  if s:path !~# '\~$' && isdirectory(s:path)
    let &runtimepath = &runtimepath.','.s:path
  end
endfor
unlet s:path

"---------------------------------------------------------------------------
" 基本設定:
"---------------------------------------------------------------------------
" 行番号を表示
set number

" ルーラーを表示
set ruler

" 長い行を折り返して表示
set wrap

" 常にステータス行を表示
set laststatus=2

" コマンドをステータス行に表示
set showcmd

" タイトルを表示
set title

"---------------------------------------------------------------------------
" 編集に関する設定:
"---------------------------------------------------------------------------
" タブの画面上での幅
set tabstop=4

" タブをスペースに展開しない
set noexpandtab

" 自動的にインデントする
set autoindent

" 検索時にファイルの最後まで行ったら最初に戻る
set wrapscan

" 括弧入力時に対応する括弧を表示
set showmatch

" コマンドライン補完するときに強化されたものを使う(参照 :help wildmenu)
set wildmenu

" テキスト挿入中の自動折り返しを日本語に対応させる
set formatoptions+=mM


