"---------------------------------------------------------------------------
" plugins下のディレクトリをruntimepathへ追加する。
"---------------------------------------------------------------------------
for s:path in split(glob($VIM.'/plugins/*'), '\n')
  if s:path !~# '\~$' && isdirectory(s:path)
    let &runtimepath = &runtimepath.','.s:path
  end
endfor
unlet s:path

"---------------------------------------------------------------------------
" 基本設定:
"---------------------------------------------------------------------------
" 行番号を表示
set number

" ルーラーを表示
set ruler

" 長い行を折り返して表示
set wrap

" 常にステータス行を表示
set laststatus=2

" コマンドをステータス行に表示
set showcmd

" タイトルを表示
set title

" シンタックス表示
syntax on

" clipboardの設定
set clipboard=unnamed

" vimの文字コードをUTF-8に設定
set enc=utf-8

" ファイル保存時の文字コード
set fenc=utf-8

"---------------------------------------------------------------------------
" 編集に関する設定:
"---------------------------------------------------------------------------
" タブの画面上での幅
set tabstop=4

" タブをスペースに展開しない
set noexpandtab

" 自動的にインデントする
set autoindent

" 括弧入力時に対応する括弧を表示
set showmatch

" コマンドライン補完するときに強化されたものを使う(参照 :help wildmenu)
set wildmenu

" テキスト挿入中の自動折り返しを日本語に対応させる
set formatoptions+=mM

"---------------------------------------------------------------------------
" 検索に関する設定:
"---------------------------------------------------------------------------
"              小文字                大文字
"*************************************************************************** 
"| ignorecase              : 大文字小文字を無視 : 大文字小文字を無視       |
"| ignorecase + smartcase  : 大文字小文字を無視 : 普通の検索               |
"| ignorecaseなし          : 普通の検索         : 普通の検索               |
"*************************************************************************** 
" 検索時に大文字小文字を無視
set ignorecase

" 大文字小文字の両方が含まれている場合は大文字小文字を区別
set smartcase

" 検索時にファイルの最後まで行ったら最初に戻る
set wrapscan

"---------------------------------------------------------------------------
" バックアップに関する設定:
"---------------------------------------------------------------------------
" スワップファイルの設定
set swapfile
set directory=$VIM/temp/swp

" バックアップファイルの設定
set backup
set backupdir=$VIM/temp/backup

" インフォファイルの設定
set viminfo=

" アンドゥファイルの設定
set noundofile
